Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/asylum_seekers_and_refugees/refugee_status_and_leave_to_remain/copy_of_medical_services_and_entitlements_for_refugees_and_asylum_seekers.html.txt.tmx
Source language: en
Languages: ga

source: Medical services and social welfare for people with refugee status or subsidiary protection or permisson to remain
ga: Seirbhísí leighis agus teidlíochtaí leasa shóisialaigh le doinnedo dhídeanaithe agus daoine a dtugtar cead chun fanacht doibh

source: If you have been granted international protection (refugee status or subsidiary protection) you have the right to receive the same medical care and services and the same social welfare benefits as an Irish citizen
ga: Má bhronntar cosaint idirnáisiúnta (stádas dídeanaithe nó cosanta coimhdí) ort, tá tú i dteideal cúram agus seirbhísí leighis agus sochair leasa shóisialaigh a fháil ar bhonn céanna mar shaoránach Éireannach

source: The Department of Justice and Equality has published a guide to living independently (pdf) for people who have been granted refugee status or subsidiary protection or permission to remain
ga: D’fhoilsigh an Roinn Dlí agus Cirt agus Comhionannas treoir um maireachtáil neamhspleách (pdf) do dhaoine a bhronntar stádas dídeanaí nó cosaint choimhdeach nó cead fanacht dóibh

source: The medical services you received as an asylum seeker will continue if you have been granted refugee status or subsidiary protection or permission to remain, as there is no difference in the provision for asylum seekers and people with refugee status or subsidiary protection or permission to remain
ga: Leanfaidh na seirbhísí leighis a fuair tú mar iarrthóir tearmainn ar aghaidh má bhronntar stádas dídeanai nó cosanta coimhdí nó cead fanachta ort, mar nach bhfuil difear ar bith sa soláthar d’iarrthóirí tearmainn agus daoine le stádas dídeanaithe nó cosanta coimhdí dídeanaithe nó cead fanachta

source: The receptionist at the local health centre (see 'Where to apply' below) will provide you with a medical card application form, which you should complete and return to the Local Health Office as soon as possible
ga: Tabharfaidh an fáilteoir ag d’ionad sláinte áitiúil (féach 'Cá háit a ndéanfaidh mé iarratas' thíos) foirm iarratais ar chárta leighis duit

source: The medical card allows you and your family to access medical services free of charge
ga: Ba chóir duit í seo a chomhlíonadh agus a sheoladh ar ais chuig an Oifig Sláinte Áitiúil chomh luath agus is féidir

source: If you do not apply for and receive a medical card, you will be asked to pay for certain medical services
ga: Ligeann cárta leighis duit agus do do theaghlach rochtain a fháil ar sheirbhísí leighis saor in aisce

source: When you apply for a medical card, you choose a doctor that is taking part in the scheme and ask the doctor to sign your application form to accept you as a patient
ga: Nuair a dhéanann tú iarratas ar chárta leighis, roghnaíonn tú dochtúir a bhfuil páirt á glacadh aige/aici sa scéim agus iarrann tú ar an dochtúir d’fhoirm iarratais a shíniú chun glacadh leat mar othar

source: Contact your Local Health Office for details of GPs in your area
ga: Déan teagmháil le d’Oifig Sláinte Áitiúil chun teacht ar shonraí ar LGanna i do cheantar

source: A medical card issued by the Health Service Executive enables you to receive free general practitioner services; prescribed drugs and medicines (some prescription charges apply); in-patient public hospital services; out-patient public hospital services; dental, optical and aural health services; medical appliances; maternity and infant care services; a maternity cash grant of €10.16 on the birth of each child and psychological services for those traumatised by torture, rape or other critical life experiences,
ga: Cuireann cárta leighis ar do chumas, arna eisiúint ag Feidhmeannacht na Seirbhíse Sláinte, seirbhísí liachleachtóra ghinearálta a fháil saor in aisce; drugaí agus cógais ar oideas (le roinnt eisceachtaí); seirbhísí mar othar cónaitheach in ospidéal poiblí; seirbhísí othair sheachtraigh; seirbhísí fiaclóireachta, optúla agus cluaise; gairis leighis; seirbhísí chúram máithreachais agus naíonán. Íocfar deontas €10.16 in airgead tirim ar bhreith gach leanbh. Cuirfear seirbhísí síceolaíochta ar fáil dóibh siúd ar tharla tráma dóibh de thoradh pianta, éignithe, nó droch-eispéireas eile ina saol

source: • A Local Health Office may have waiting lists for these services and may have to give priority on the basis of medical need
ga: • D’fhéadfadh liostaí feithimh a bheith ag Oifig Sláinte Áitiúil do na seirbhísí seo agus leithdháilfear tús áite ar bhunús riachtanais leighis

source: • If you are pregnant or have small children, you should contact the local public health nurse at your local health centre
ga: • Má tá tú ag iompar clainne nó má tá leanaí óga agat, ba cheart duit dul i dteagmháil leis an Altra Sláinte Poiblí (ASP) i d’ionad sláinte áitiúil

source: The nurse will keep in touch with you during your pregnancy and after the birth of your child and will offer help and advice
ga: Fanfaidh an t-altra i dteagmháil leat fad is a bhíonn tú ag iompar agus i ndiaidh bhreith do linbh agus tabharfaidh siad cabhair agus comhairle duit

source: • If your income is too high to allow you avail of a medical card, you are entitled to general hospital services
ga: • Má tá ioncam ró-ard agat le leas a bhaint as carta leighis, tá tú fós i dteideal seirbhísí ospidéil ghinearálta a fháil

source: Other services, such as GP services, must be paid for
ga: Beidh ort íoc as seirbhísí eile ar nós seirbhísí liachleachtóra ghinearálta

source: It is possible to take out medical insurance to cover you and your family's medical needs
ga: Féadfaidh tú árachas leighis a fháil le do riachtanas leighis féin agus riachtanas do chlainne a chumhdach

source: If you have refugee status or subsidiary protection you are entitled to apply for social welfare payments on the same basis as an Irish citizen. Each social welfare payment has rules and conditions attached
ga: Mar tá stádas dídeanaithe nó cosanta coimhdí agat, tá an ceart céanna agat cur isteach ar íocaíochtaí leasa shóisialaigh is atá ag saoránach Éireannach ar bith

source: You will satisfy the habitual residence condition, but you will have to meet other conditions
ga: Tá rialacha agus coinníollacha ag baint le gach íocaíocht leasa shóisialaigh

source: There is a broad range of social welfare entitlements
ga: Ní gá go gcomhlíonfá an coinníoll gnáth-chónaithe, ach caithfidh tú coinníollacha eile a chomhlíonadh

source: Your local social welfare office or Intreo centre will help you to apply for the correct payment for your situation - see 'Where to apply' below
ga: Tá réimse leathan íocaíochtaí leasa shóisialaigh ann, agus gheobhaidh tú cúnamh i do oifig leasa shóisialaigh áitiúil nó ionad Intreo le cur isteach ar an íocaíocht chuí a fheileann do chás - féach 'Cá háit a dhéanfaidh mé iarratas' thíos

source: If you have been granted permission to remain, you are entitled to apply for social welfare payments as above
ga: Má tá cead fanachta agat, tá an ceart céanna agat cur isteach ar íocaíochtaí leasa shóisialaigh

source: However, if you are getting a social welfare payment this may affect the renewal of your permission to remain or an application for citizenship
ga: Áfach, má fhaigheann tú íocaíocht leasa shóisialaigh, is féidirgo mbeadh éifeacht ar athnuacháin do chead chun fanacht nó iarratas ar shaoránacht

source: The following are some examples of social welfare payments:
ga: Seo a leanas roinnt samplaí de íocaíochtaí leasa shóisialaigh:

source: • You have the right to work, so if you are able to work but are currently unemployed, you can apply for Jobseeker's Allowance
ga: Mar sin má tá tú in ann obair a dhéanamh ach go bhfuil tú as obair faoi láthair, féadfaidh tú cur isteach ar Liúntas Cuardaitheora Poist

source: • If you are unable to work due to disability or illness you can apply for Disability Allowance
ga: • Mura bhfuil tú in ann aon obair a dhéanamh de bharr míchumais nó tinnis féadfaidh tú cur isteach ar Liúntas Míchumais

source: • If you are parenting alone you can apply for the One-Parent Family Payment
ga: • Mura bhfuil tú in ann aon obair a dhéanamh de bhrí gur tuismitheoir aonair tú féadfaidh tú cur isteach ar Íocaíocht Teaghlaigh Aontuismitheora

source: • If you are the parent or guardian of a child you can apply for Child Benefit
ga: • Más tuismitheoir nó caomhnóir gasúir tú féadfaidh tú cur isteach ar Shochar Linbh

source: While waiting for a decision on your application for a social welfare payment, you can apply for Supplementary Welfare Allowance
ga: Fad is atá tú ag fanacht ar thoradh do iarratais ar íocaíocht leasa shóisialaigh, féadfaidh tú cur isteach ar Liúntas Leasa Forlíontach

source: Apply to the Department of Social Protection's representative (formerly the Community Welfare Officer)
ga: Déan iarratas chuig an t-ionadaí na Roinne Coimirce Sóisialaí (tugadh Oifigeach Leasa Pobail air roimhe seo)

source: Contact your local health centre and your local social welfare office or Intreo Centre
ga: Déan teagmháil le d'ionad sláinte áitiúil agus d'oifig leasa shóisialaigh áitiúil nó ionad Intreo
